Revit 2024 API
ExternalServiceId.Equality Operator
Compares two ExternalServiceId instances.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static bool operator ==(
	ExternalServiceId first,
	ExternalServiceId second
)
Visual Basic
Public Shared Operator = ( _
	first As ExternalServiceId, _
	second As ExternalServiceId _
) As Boolean
Visual C++
public:
static bool operator ==(
	ExternalServiceId^ first,
	ExternalServiceId^ second
)
Parameters
first
Type: Autodesk.Revit.DB.ExternalService.ExternalServiceId
The first ExternalServiceId.
second
Type: Autodesk.Revit.DB.ExternalService.ExternalServiceId
The second ExternalServiceId.
Return Value
True if the inputs are identical, false if they are different.
See Also
ExternalServiceId Class
Autodesk.Revit.DB.ExternalService Namespace